app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post].permit(:title, :picture, :tag_list, :price))
    @post.save
---
INSERT INTO "posts" ("created_at", "price", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-08-26 15:32:45.767715"], ["price", 100], ["title", ""], ["updated_at", "2014-08-26 15:32:45.767715"]]
INSERT INTO "tags" ("created_at", "text", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-08-20 13:04:01.779522"], ["text", ""], ["updated_at", "2014-08-20 13:04:01.779522"]]